docs/content/serasa.mdx

---
title: "Serasa"
metaTitle: ''
metaDescription: ''
---

## ✅ Avaliação

- Dificuldade de implementação: **Médio**
- Dificuldade de manutenção: **Médio**
- Tempo médio de resposta da API: **756ms**
- Linguagem da API: **XML**

## Exemplo de requisição:

**HOMOLOG:**

**[POST]** https://sitenethomologa.serasa.com.br:443/experian-data-licensing-ws/dataLicensingService

<hr/>

**PROD:**

**[POST]** https://sitenet.serasa.com.br:443/experian-data-licensing-ws/dataLicensingService

## XML Entrada

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://services.experian.com.br/DataLicensing/DataLicensingService/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-2">
            <wsse:Username>USERNAME</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">PASSWORD</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <dat:ConsultarPF>
         <parameters>
            <cpf>33439893634</cpf>
            <RetornoPF>
			<cpf>true</cpf>
			<nome>true</nome>
			<endereco>true</endereco>
			<situacaoCadastral>HISTORICO</situacaoCadastral>
            </RetornoPF>
         </parameters>
      </dat:ConsultarPF>
   </soapenv:Body>
</soapenv:Envelope>
```

## XML Saída

```xml
<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope
  xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <S:Header>
    <wsse:Security S:mustUnderstand="1">
      <wsu:Timestamp
        xmlns:ns15="http://schemas.xmlsoap.org/ws/2006/02/addressingidentity"
        xmlns:ns14="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
        xmlns:ns13="http://www.w3.org/2003/05/soap-envelope" wsu:Id="_1">
        <wsu:Created>2020-09-02T14:47:14Z</wsu:Created>
        <wsu:Expires>2020-09-02T14:52:14Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </S:Header>
  <S:Body>
    <ns2:ConsultarPFResponse
      xmlns:ns3="http://ws.wim.omninetworking.com.br/"
      xmlns:ns2="http://services.experian.com.br/DataLicensing/DataLicensingService/">
      <result>
        <enderecos>
          <endereco>
            <logradouro>
              <Tipo>R</Tipo>
              <Titulo>DR</Titulo>
              <Nome>JOAO PENIDO FILHO</Nome>
              <Numero>28</Numero>
              <Complemento>200</Complemento>
              <CepNota>10</CepNota>
            </logradouro>
            <bairro>BOM PASTOR</bairro>
            <cidade>JUIZ DE FORA</cidade>
            <uf>MG</uf>
            <cep>36021600</cep>
            <idFinalidade>0</idFinalidade>
          </endereco>
          <endereco>
            <logradouro>
              <Tipo>R</Tipo>
              <Titulo>DR</Titulo>
              <Nome>ORMINDO MAIA</Nome>
              <Numero>1324</Numero>
              <CepNota>10</CepNota>
            </logradouro>
            <bairro>BSQ DO IMPERADOR</bairro>
            <cidade>JUIZ DE FORA</cidade>
            <uf>MG</uf>
            <cep>36037640</cep>
            <idFinalidade>0</idFinalidade>
          </endereco>
        </enderecos>
        <cpf>33439893634</cpf>
        <nome>JOYCE CHAIPP MOCKDECE HALLACK</nome>
        <situacaoCadastral>
          <codigoSituacao>1</codigoSituacao>
          <nome>JOYCE CHAIPP MOCKDECE HALLACK</nome>
          <situacao>REGULAR</situacao>
          <codigoControle>493B.DF83.41D4.D136</codigoControle>
          <dataConsulta>2018-01-02T00:00:00.000-02:00</dataConsulta>
          <fontePesquisada>HISTORICO</fontePesquisada>
        </situacaoCadastral>
      </result>
    </ns2:ConsultarPFResponse>
  </S:Body>
</S:Envelope>
```
